[
  {
    "id": "1",
    "title": "PlayerUnknown's Battlegrounds (PUBG)",
    "coverPhoto": "https://i.ibb.co/n8cM357K/pubg.png",
    "category": "Battle Royale",
    "downloadLink": "https://www.pubg.com/",
    "description": "PlayerUnknown’s Battlegrounds (PUBG) is one of the most influential battle royale games that redefined online multiplayer experiences. In PUBG, up to 100 players parachute onto a vast and diverse map where they must scavenge for weapons, armor, and supplies while fighting to be the last survivor or team standing. Each match begins with players choosing their landing zones, creating endless strategic possibilities. The playable area gradually shrinks over time, forcing encounters and increasing tension as players adapt to the shrinking safe zone. The game offers multiple maps, including Erangel, Miramar, Sanhok, and Vikendi, each with distinct terrain, weather patterns, and tactical challenges. Whether you prefer sniping from a distance, ambushing in dense forests, or storming buildings with close-range combat, PUBG’s realistic gun mechanics and physics make every fight intense and satisfying. Its ranked mode, seasonal events, and regular updates keep gameplay fresh and competitive. With solo, duo, and squad options, players can enjoy teamwork, coordination, and tactical communication. PUBG’s combination of strategy, reflex, and survival instincts delivers an adrenaline-fueled experience that rewards skill, patience, and smart decision-making. It’s a game that continues to evolve and engage millions of players around the world.",
    "ratings": "4.5",
    "developer": "Krafton"
  },
  {
    "id": "2",
    "title": "Stardew Valley",
    "coverPhoto": "https://i.ibb.co/Z61TDmSr/Logo-of-Stardew-Valley.png",
    "category": "Simulation",
    "downloadLink": "https://www.stardewvalley.net/",
    "description": "Stardew Valley is a heartwarming farming simulation and life-building RPG that invites players to escape the chaos of city life and start anew in a small rural town. After inheriting a run-down farm from your grandfather, you begin your journey by clearing the land, planting crops, raising animals, and slowly transforming your farm into a thriving homestead. But Stardew Valley is much more than farming — it’s about building relationships with the villagers, participating in seasonal festivals, exploring mysterious caves, and uncovering the secrets of the valley. You can fish, cook, craft tools, mine valuable resources, and even marry and start a family. Each in-game season brings unique crops, events, and weather patterns, encouraging players to plan and adapt their strategies. The pixel-art graphics, calming music, and charming storytelling create a nostalgic yet modern experience that captures the joy of simple living. Whether you prefer peaceful farming or adventurous dungeon-exploring, Stardew Valley offers freedom and creativity in abundance. It’s a soothing yet rewarding game that allows players to progress at their own pace, express individuality, and find meaning in community and connection — making it one of the most beloved indie games ever created.",
    "ratings": "4.8",
    "developer": "ConcernedApe"
  },
  {
    "id": "3",
    "title": "The Legend of Zelda: Breath of the Wild",
    "coverPhoto": "https://i.ibb.co/WWVp94v1/The-Legend-Of-Zelda-Breath-Of-The-Wild-Download-Free-PNG.png",
    "category": "Adventure",
    "downloadLink": "https://www.zelda.com/breath-of-the-wild/",
    "description": "The Legend of Zelda: Breath of the Wild is a groundbreaking open-world adventure that reimagines one of gaming’s most iconic franchises. Players step into the role of Link, who awakens from a century-long slumber to find the kingdom of Hyrule in ruins and the evil Calamity Ganon threatening to destroy it. Armed with courage, wit, and the mysterious Sheikah Slate, Link sets out on an epic journey to explore vast landscapes filled with forests, deserts, snowy mountains, and ancient ruins. The game’s physics-driven world encourages creativity — you can climb any surface, glide across valleys, cook meals, craft elixirs, and solve hundreds of environmental puzzles known as Shrines. Every encounter can be approached in countless ways, allowing complete freedom in exploration and combat. Breath of the Wild’s stunning art style, dynamic weather system, and immersive soundtrack create a living, breathing world that feels alive and unpredictable. Players can tame wild horses, battle powerful foes, discover hidden treasures, and uncover Hyrule’s deep history through subtle storytelling. With its combination of exploration, strategy, and discovery, Breath of the Wild delivers a timeless experience that inspires wonder and adventure at every turn.",
    "ratings": "4.9",
    "developer": "Nintendo"
  }
]
